bench-runs/read-n10000-c10-2026-08-28-18-15-35.txt

Summary:
  Total:	0.6344 secs
  Slowest:	0.0193 secs
  Fastest:	0.0002 secs
  Average:	0.0006 secs
  Requests/sec:	15764.1380
  
  Total data:	420000 bytes
  Size/request:	42 bytes

Response time histogram:
  0.000 [1]	|
  0.002 [9987]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.004 [2]	|
  0.006 [0]	|
  0.008 [0]	|
  0.010 [0]	|
  0.012 [0]	|
  0.014 [0]	|
  0.015 [0]	|
  0.017 [0]	|
  0.019 [10]	|


Latency distribution:
  10%% in 0.0005 secs
  25%% in 0.0005 secs
  50%% in 0.0006 secs
  75%% in 0.0007 secs
  90%% in 0.0008 secs
  95%% in 0.0009 secs
  99%% in 0.0011 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0052 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0021 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0012 secs
  resp wait:	0.0006 secs, 0.0002 secs, 0.0113 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0007 secs

Status code distribution:
  [302]	10000 responses