bench-runs/read-n10000-c10-2026-08-29-16-54-40.txt

Summary:
  Total:	0.6178 secs
  Slowest:	0.0052 secs
  Fastest:	0.0002 secs
  Average:	0.0006 secs
  Requests/sec:	16185.2204
  
  Total data:	420000 bytes
  Size/request:	42 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [8284]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.001 [1667]	|■■■■■■■■
  0.002 [36]	|
  0.002 [2]	|
  0.003 [0]	|
  0.003 [0]	|
  0.004 [0]	|
  0.004 [0]	|
  0.005 [0]	|
  0.005 [10]	|


Latency distribution:
  10%% in 0.0004 secs
  25%% in 0.0005 secs
  50%% in 0.0006 secs
  75%% in 0.0007 secs
  90%% in 0.0008 secs
  95%% in 0.0009 secs
  99%% in 0.0011 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0022 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0015 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0005 secs
  resp wait:	0.0006 secs, 0.0002 secs, 0.0030 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0006 secs

Status code distribution:
  [302]	10000 responses