bench-runs/read-n10000-c100-2026-08-28-18-15-43.txt

Summary:
  Total:	0.5287 secs
  Slowest:	0.0184 secs
  Fastest:	0.0009 secs
  Average:	0.0053 secs
  Requests/sec:	18914.3867
  
  Total data:	420000 bytes
  Size/request:	42 bytes

Response time histogram:
  0.001 [1]	|
  0.003 [8]	|
  0.004 [241]	|■
  0.006 [9303]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.008 [347]	|■
  0.010 [5]	|
  0.011 [16]	|
  0.013 [23]	|
  0.015 [17]	|
  0.017 [23]	|
  0.018 [16]	|


Latency distribution:
  10%% in 0.0046 secs
  25%% in 0.0048 secs
  50%% in 0.0051 secs
  75%% in 0.0055 secs
  90%% in 0.0059 secs
  95%% in 0.0062 secs
  99%% in 0.0086 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0061 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0027 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0010 secs
  resp wait:	0.0052 secs, 0.0009 secs, 0.0123 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0020 secs

Status code distribution:
  [302]	10000 responses