bench-runs/read-n10000-c100-2026-08-29-16-54-49.txt

Summary:
  Total:	0.3900 secs
  Slowest:	0.0616 secs
  Fastest:	0.0003 secs
  Average:	0.0038 secs
  Requests/sec:	25642.9817
  
  Total data:	420000 bytes
  Size/request:	42 bytes

Response time histogram:
  0.000 [1]	|
  0.006 [9751]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.013 [148]	|■
  0.019 [25]	|
  0.025 [0]	|
  0.031 [0]	|
  0.037 [5]	|
  0.043 [19]	|
  0.049 [11]	|
  0.056 [8]	|
  0.062 [32]	|


Latency distribution:
  10%% in 0.0022 secs
  25%% in 0.0027 secs
  50%% in 0.0033 secs
  75%% in 0.0040 secs
  90%% in 0.0048 secs
  95%% in 0.0054 secs
  99%% in 0.0162 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0067 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0046 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0016 secs
  resp wait:	0.0036 secs, 0.0002 secs, 0.0555 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0018 secs

Status code distribution:
  [302]	10000 responses