bench-runs/read-n10000-c125-2026-08-29-17-04-57.txt

Summary:
  Total:	0.3616 secs
  Slowest:	0.0364 secs
  Fastest:	0.0003 secs
  Average:	0.0044 secs
  Requests/sec:	27652.6495
  
  Total data:	420000 bytes
  Size/request:	42 bytes

Response time histogram:
  0.000 [1]	|
  0.004 [4384]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.008 [5384]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.011 [85]	|■
  0.015 [36]	|
  0.018 [20]	|
  0.022 [10]	|
  0.026 [13]	|
  0.029 [19]	|
  0.033 [16]	|
  0.036 [32]	|


Latency distribution:
  10%% in 0.0027 secs
  25%% in 0.0033 secs
  50%% in 0.0041 secs
  75%% in 0.0049 secs
  90%% in 0.0058 secs
  95%% in 0.0064 secs
  99%% in 0.0156 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0000 secs, 0.0091 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0030 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0022 secs
  resp wait:	0.0042 secs, 0.0003 secs, 0.0269 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0035 secs

Status code distribution:
  [302]	10000 responses