bench-runs/read-n10000-c130-2026-08-29-17-16-10.txt

Summary:
  Total:	0.3326 secs
  Slowest:	0.0285 secs
  Fastest:	0.0002 secs
  Average:	0.0043 secs
  Requests/sec:	29702.2373
  
  Total data:	414960 bytes
  Size/request:	42 bytes

Response time histogram:
  0.000 [1]	|
  0.003 [1776]	|■■■■■■■■■■
  0.006 [7251]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.009 [715]	|■■■■
  0.012 [7]	|
  0.014 [52]	|
  0.017 [24]	|
  0.020 [14]	|
  0.023 [15]	|
  0.026 [6]	|
  0.029 [19]	|


Latency distribution:
  10%% in 0.0026 secs
  25%% in 0.0033 secs
  50%% in 0.0040 secs
  75%% in 0.0049 secs
  90%% in 0.0057 secs
  95%% in 0.0064 secs
  99%% in 0.0135 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0000 secs, 0.0105 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0039 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0029 secs
  resp wait:	0.0040 secs, 0.0002 secs, 0.0189 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0037 secs

Status code distribution:
  [302]	9880 responses