bench-runs/read-n10000-c140-2026-08-29-17-16-14.txt

Summary:
  Total:	0.3144 secs
  Slowest:	0.0218 secs
  Fastest:	0.0003 secs
  Average:	0.0043 secs
  Requests/sec:	31613.1115
  
  Total data:	417480 bytes
  Size/request:	42 bytes

Response time histogram:
  0.000 [1]	|
  0.002 [1124]	|■■■■■■■■
  0.005 [5745]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.007 [2333]	|■■■■■■■■■■■■■■■■
  0.009 [489]	|■■■
  0.011 [79]	|■
  0.013 [21]	|
  0.015 [20]	|
  0.018 [3]	|
  0.020 [109]	|■
  0.022 [16]	|


Latency distribution:
  10%% in 0.0024 secs
  25%% in 0.0031 secs
  50%% in 0.0039 secs
  75%% in 0.0049 secs
  90%% in 0.0063 secs
  95%% in 0.0074 secs
  99%% in 0.0180 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0000 secs, 0.0077 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0032 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0058 secs
  resp wait:	0.0038 secs, 0.0003 secs, 0.0143 secs
  resp read:	0.0003 secs, 0.0000 secs, 0.0057 secs

Status code distribution:
  [302]	9940 responses