bench-runs/read-n10000-c140-2026-08-29-18-50-13-lru.txt

Summary:
  Total:	0.1651 secs
  Slowest:	0.0208 secs
  Fastest:	0.0000 secs
  Average:	0.0022 secs
  Requests/sec:	60193.4640
  
  Total data:	417480 bytes
  Size/request:	42 bytes

Response time histogram:
  0.000 [1]	|
  0.002 [6122]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.004 [3137]	|■■■■■■■■■■■■■■■■■■■■
  0.006 [507]	|■■■
  0.008 [33]	|
  0.010 [1]	|
  0.012 [23]	|
  0.015 [39]	|
  0.017 [23]	|
  0.019 [28]	|
  0.021 [26]	|


Latency distribution:
  10%% in 0.0006 secs
  25%% in 0.0011 secs
  50%% in 0.0017 secs
  75%% in 0.0031 secs
  90%% in 0.0039 secs
  95%% in 0.0045 secs
  99%% in 0.0139 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0000 secs, 0.0083 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0025 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0034 secs
  resp wait:	0.0017 secs, 0.0000 secs, 0.0095 secs
  resp read:	0.0003 secs, 0.0000 secs, 0.0039 secs

Status code distribution:
  [302]	9940 responses