bench-runs/read-n10000-c150-2026-08-29-17-05-14.txt

Summary:
  Total:	0.3484 secs
  Slowest:	0.0341 secs
  Fastest:	0.0003 secs
  Average:	0.0051 secs
  Requests/sec:	28412.8958
  
  Total data:	415800 bytes
  Size/request:	42 bytes

Response time histogram:
  0.000 [1]	|
  0.004 [1950]	|■■■■■■■■■■■
  0.007 [7203]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.010 [568]	|■■■
  0.014 [28]	|
  0.017 [0]	|
  0.021 [0]	|
  0.024 [6]	|
  0.027 [27]	|
  0.031 [74]	|
  0.034 [43]	|


Latency distribution:
  10%% in 0.0031 secs
  25%% in 0.0038 secs
  50%% in 0.0047 secs
  75%% in 0.0056 secs
  90%% in 0.0067 secs
  95%% in 0.0075 secs
  99%% in 0.0286 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0000 secs, 0.0164 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0050 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0037 secs
  resp wait:	0.0047 secs, 0.0002 secs, 0.0177 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0047 secs

Status code distribution:
  [302]	9900 responses