bench-runs/read-n10000-c150-2026-08-29-18-52-01-lru.txt

Summary:
  Total:	0.1562 secs
  Slowest:	0.0191 secs
  Fastest:	0.0000 secs
  Average:	0.0023 secs
  Requests/sec:	63383.3587
  
  Total data:	415800 bytes
  Size/request:	42 bytes

Response time histogram:
  0.000 [1]	|
  0.002 [5660]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.004 [3071]	|■■■■■■■■■■■■■■■■■■■■■■
  0.006 [954]	|■■■■■■■
  0.008 [53]	|
  0.010 [12]	|
  0.011 [32]	|
  0.013 [33]	|
  0.015 [41]	|
  0.017 [34]	|
  0.019 [9]	|


Latency distribution:
  10%% in 0.0006 secs
  25%% in 0.0012 secs
  50%% in 0.0018 secs
  75%% in 0.0031 secs
  90%% in 0.0039 secs
  95%% in 0.0044 secs
  99%% in 0.0126 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0000 secs, 0.0089 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0040 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0031 secs
  resp wait:	0.0018 secs, 0.0000 secs, 0.0083 secs
  resp read:	0.0003 secs, 0.0000 secs, 0.0039 secs

Status code distribution:
  [302]	9900 responses