bench-runs/read-n10000-c160-2026-08-29-17-16-20.txt

Summary:
  Total:	0.3154 secs
  Slowest:	0.0234 secs
  Fastest:	0.0002 secs
  Average:	0.0049 secs
  Requests/sec:	31456.3381
  
  Total data:	416640 bytes
  Size/request:	42 bytes

Response time histogram:
  0.000 [1]	|
  0.003 [633]	|■■■■■
  0.005 [5285]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.007 [3122]	|■■■■■■■■■■■■■■■■■■■■■■■■
  0.009 [535]	|■■■■
  0.012 [158]	|■
  0.014 [25]	|
  0.016 [7]	|
  0.019 [48]	|
  0.021 [31]	|
  0.023 [75]	|■


Latency distribution:
  10%% in 0.0029 secs
  25%% in 0.0037 secs
  50%% in 0.0045 secs
  75%% in 0.0056 secs
  90%% in 0.0069 secs
  95%% in 0.0086 secs
  99%% in 0.0189 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0000 secs, 0.0069 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0033 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0045 secs
  resp wait:	0.0045 secs, 0.0002 secs, 0.0156 secs
  resp read:	0.0003 secs, 0.0000 secs, 0.0052 secs

Status code distribution:
  [302]	9920 responses