bench-runs/read-n10000-c160-2026-08-29-18-52-25-lru.txt

Summary:
  Total:	0.1569 secs
  Slowest:	0.0212 secs
  Fastest:	0.0000 secs
  Average:	0.0024 secs
  Requests/sec:	63243.1226
  
  Total data:	416640 bytes
  Size/request:	42 bytes

Response time histogram:
  0.000 [1]	|
  0.002 [6081]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.004 [2664]	|■■■■■■■■■■■■■■■■■■
  0.006 [950]	|■■■■■■
  0.009 [64]	|
  0.011 [14]	|
  0.013 [27]	|
  0.015 [24]	|
  0.017 [72]	|
  0.019 [18]	|
  0.021 [5]	|


Latency distribution:
  10%% in 0.0007 secs
  25%% in 0.0011 secs
  50%% in 0.0019 secs
  75%% in 0.0031 secs
  90%% in 0.0044 secs
  95%% in 0.0048 secs
  99%% in 0.0148 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0000 secs, 0.0087 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0061 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0034 secs
  resp wait:	0.0019 secs, 0.0000 secs, 0.0077 secs
  resp read:	0.0003 secs, 0.0000 secs, 0.0034 secs

Status code distribution:
  [302]	9920 responses