bench-runs/read-n10000-c175-2026-08-29-17-05-33.txt

Summary:
  Total:	0.3453 secs
  Slowest:	0.0379 secs
  Fastest:	0.0002 secs
  Average:	0.0059 secs
  Requests/sec:	28887.8085
  
  Total data:	418950 bytes
  Size/request:	42 bytes

Response time histogram:
  0.000 [1]	|
  0.004 [1664]	|■■■■■■■■■
  0.008 [7275]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.012 [677]	|■■■■
  0.015 [172]	|■
  0.019 [11]	|
  0.023 [6]	|
  0.027 [62]	|
  0.030 [58]	|
  0.034 [25]	|
  0.038 [24]	|


Latency distribution:
  10%% in 0.0035 secs
  25%% in 0.0044 secs
  50%% in 0.0053 secs
  75%% in 0.0064 secs
  90%% in 0.0079 secs
  95%% in 0.0096 secs
  99%% in 0.0269 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0000 secs, 0.0114 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0034 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0040 secs
  resp wait:	0.0054 secs, 0.0002 secs, 0.0179 secs
  resp read:	0.0002 secs, 0.0000 secs, 0.0052 secs

Status code distribution:
  [302]	9975 responses