bench-runs/read-n10000-c175-2026-08-29-18-55-08-lru.txt

Summary:
  Total:	0.1594 secs
  Slowest:	0.0234 secs
  Fastest:	0.0001 secs
  Average:	0.0027 secs
  Requests/sec:	62561.2316
  
  Total data:	418950 bytes
  Size/request:	42 bytes

Response time histogram:
  0.000 [1]	|
  0.002 [6673]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.005 [2282]	|■■■■■■■■■■■■■■
  0.007 [744]	|■■■■
  0.009 [100]	|■
  0.012 [16]	|
  0.014 [35]	|
  0.016 [56]	|
  0.019 [47]	|
  0.021 [14]	|
  0.023 [7]	|


Latency distribution:
  10%% in 0.0010 secs
  25%% in 0.0017 secs
  50%% in 0.0021 secs
  75%% in 0.0029 secs
  90%% in 0.0048 secs
  95%% in 0.0058 secs
  99%% in 0.0150 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0000 secs, 0.0124 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0048 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0028 secs
  resp wait:	0.0021 secs, 0.0000 secs, 0.0114 secs
  resp read:	0.0003 secs, 0.0000 secs, 0.0038 secs

Status code distribution:
  [302]	9975 responses