bench-runs/read-n10000-c200-2026-08-29-17-13-31.txt

Summary:
  Total:	0.3618 secs
  Slowest:	0.0556 secs
  Fastest:	0.0002 secs
  Average:	0.0070 secs
  Requests/sec:	27643.3651
  
  Total data:	420000 bytes
  Size/request:	42 bytes

Response time histogram:
  0.000 [1]	|
  0.006 [3612]	|■■■■■■■■■■■■■■■■■■■■■■■■
  0.011 [5963]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.017 [195]	|■
  0.022 [26]	|
  0.028 [7]	|
  0.033 [13]	|
  0.039 [39]	|
  0.045 [97]	|■
  0.050 [28]	|
  0.056 [19]	|


Latency distribution:
  10%% in 0.0043 secs
  25%% in 0.0053 secs
  50%% in 0.0063 secs
  75%% in 0.0072 secs
  90%% in 0.0085 secs
  95%% in 0.0102 secs
  99%% in 0.0404 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0000 secs, 0.0087 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0147 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0057 secs
  resp wait:	0.0063 secs, 0.0002 secs, 0.0323 secs
  resp read:	0.0002 secs, 0.0000 secs, 0.0059 secs

Status code distribution:
  [302]	10000 responses